Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 bidirectional (Bidirectiona  (None, 336)              228480    
 l)                                                              
                                                                 
 dense (Dense)               (None, 1)                 337       
                                                                 
=================================================================
Total params: 228,817
Trainable params: 228,817
Non-trainable params: 0
_________________________________________________________________
MSE = 38.0195
RMSE = 6.1660
SSE = 6387008.7049
MAE = 2.3011
MAPE = 40419487744.0000
R2 = 0.8918
