Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 gru (GRU)                   (None, 168)               86184     
                                                                 
 dense (Dense)               (None, 1)                 169       
                                                                 
=================================================================
Total params: 86,353
Trainable params: 86,353
Non-trainable params: 0
_________________________________________________________________
MSE = 38.0760
RMSE = 6.1706
SSE = 6396493.1729
MAE = 2.4503
MAPE = 63262609408.0000
R2 = 0.8916

step = 7
rate = 0.9