Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 168)               114240    
                                                                 
 dense (Dense)               (None, 1)                 169       
                                                                 
=================================================================
Total params: 114,409
Trainable params: 114,409
Non-trainable params: 0
_________________________________________________________________
RMSE = 3.18
MSE = 10.09
EVS = 0.75
R2 = 0.70
