Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 168)               114240    
                                                                 
 dense (Dense)               (None, 1)                 169       
                                                                 
=================================================================
Total params: 114,409
Trainable params: 114,409
Non-trainable params: 0
_________________________________________________________________
MSE = 38.1889
RMSE = 6.1797
SSE = 6415464.6725
MAE = 2.3535
MAPE = 41587933184.0000
R2 = 0.8913

step = 7
rate = 0.9