Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 168)               114240    
                                                                 
 dense (Dense)               (None, 1)                 169       
                                                                 
=================================================================
Total params: 114,409
Trainable params: 114,409
Non-trainable params: 0
_________________________________________________________________
MSE = 37.8719
RMSE = 6.1540
SSE = 6362211.9476
MAE = 2.3287
MAPE = 62535299072.0000
R2 = 0.8922
