Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense (Dense)               (None, 28)                224       
                                                                 
 dropout (Dropout)           (None, 28)                0         
                                                                 
 dense_1 (Dense)             (None, 14)                406       
                                                                 
 dense_2 (Dense)             (None, 7)                 105       
                                                                 
 dense_3 (Dense)             (None, 1)                 8         
                                                                 
 re_lu (ReLU)                (None, 1)                 0         
                                                                 
=================================================================
Total params: 743
Trainable params: 743
Non-trainable params: 0
_________________________________________________________________
MSE = 42.8723
RMSE = 6.5477
SSE = 7202241.0318
MAE = 2.5393
MAPE = 248157257728.0000
R2 = 0.8780
