Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 5, 4)              16        
                                                                 
 conv1d_1 (Conv1D)           (None, 3, 4)              52        
                                                                 
 max_pooling1d (MaxPooling1D  (None, 1, 4)             0         
 )                                                               
                                                                 
 flatten (Flatten)           (None, 4)                 0         
                                                                 
 dropout (Dropout)           (None, 4)                 0         
                                                                 
 reshape (Reshape)           (None, 1, 4)              0         
                                                                 
 lstm (LSTM)                 (None, 64)                17664     
                                                                 
 dense (Dense)               (None, 10)                650       
                                                                 
 dense_1 (Dense)             (None, 1)                 11        
                                                                 
=================================================================
Total params: 18,393
Trainable params: 18,393
Non-trainable params: 0
_________________________________________________________________
MSE = 64.1666
RMSE = 8.0104
SSE = 10779532.4625
MAE = 3.4287
MAPE = 363369431040.0000
R2 = 0.8174


step = 7
rate = 0.9
