Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 12, 64)            384       
                                                                 
 bidirectional (Bidirectiona  (None, 12, 128)          66048     
 l)                                                              
                                                                 
 lstm_1 (LSTM)               (None, 12, 64)            49408     
                                                                 
 lstm_2 (LSTM)               (None, 12, 64)            33024     
                                                                 
 gru (GRU)                   (None, 12, 64)            24960     
                                                                 
 lstm_3 (LSTM)               (None, 50)                23000     
                                                                 
 dense (Dense)               (None, 1)                 51        
                                                                 
=================================================================
Total params: 196,875
Trainable params: 196,875
Non-trainable params: 0
_________________________________________________________________
MSE = 204.1217
RMSE = 14.2871
SSE = 3083054.4492
MAE = 12.3865
MAPE = 5.9384
R2 = -0.7609
