Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 3, 64)             384       
                                                                 
 bidirectional (Bidirectiona  (None, 3, 128)           66048     
 l)                                                              
                                                                 
 lstm_1 (LSTM)               (None, 3, 64)             49408     
                                                                 
 lstm_2 (LSTM)               (None, 3, 64)             33024     
                                                                 
 gru (GRU)                   (None, 3, 64)             24960     
                                                                 
 lstm_3 (LSTM)               (None, 50)                23000     
                                                                 
 dense (Dense)               (None, 1)                 51        
                                                                 
=================================================================
Total params: 196,875
Trainable params: 196,875
Non-trainable params: 0
_________________________________________________________________
MSE = 38.2416
RMSE = 6.1840
SSE = 6424326.2417
MAE = 2.4168
MAPE = 4159657472.0000
R2 = 0.8912
