Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv1d (Conv1D)             (None, 166, 4)            16        
                                                                 
 conv1d_1 (Conv1D)           (None, 164, 4)            52        
                                                                 
 max_pooling1d (MaxPooling1D  (None, 82, 4)            0         
 )                                                               
                                                                 
 flatten (Flatten)           (None, 328)               0         
                                                                 
 dropout (Dropout)           (None, 328)               0         
                                                                 
 reshape (Reshape)           (None, 1, 328)            0         
                                                                 
 lstm (LSTM)                 (None, 64)                100608    
                                                                 
 dense (Dense)               (None, 10)                650       
                                                                 
 dense_1 (Dense)             (None, 1)                 11        
                                                                 
=================================================================
Total params: 101,337
Trainable params: 101,337
Non-trainable params: 0
_________________________________________________________________
MSE = 30.5455
RMSE = 5.5268
SSE = 5126512.6428
MAE = 2.3999
MAPE = 556518539264.0000
R2 = 0.9131

step = 168
rate = 0.9
