Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 prototype_layer (PrototypeL  (None, 1)                225663    
 ayer)                                                           
                                                                 
 dense (Dense)               (None, 1)                 2         
                                                                 
=================================================================
Total params: 225,665
Trainable params: 225,665
Non-trainable params: 0
_________________________________________________________________
MSE = 79.0687
RMSE = 8.8921
SSE = 13282983.4456
MAE = 5.5840
MAPE = 227376758784.0000
R2 = 0.7750
