Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 prototype_layer (PrototypeL  (None, 1)                541119    
 ayer)                                                           
                                                                 
 dense (Dense)               (None, 1)                 2         
                                                                 
=================================================================
Total params: 541,121
Trainable params: 541,121
Non-trainable params: 0
_________________________________________________________________
MSE = 48.2628
RMSE = 6.9471
SSE = 8107816.7623
MAE = 2.9323
MAPE = 198944604160.0000
R2 = 0.8627
