Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 tcn (TCN)                   (None, 7, 64)             62144     
                                                                 
 lstm (LSTM)                 (None, 7, 48)             21696     
                                                                 
 lstm_1 (LSTM)               (None, 32)                10368     
                                                                 
 dense (Dense)               (None, 1)                 33        
                                                                 
=================================================================
Total params: 94,241
Trainable params: 94,241
Non-trainable params: 0
_________________________________________________________________
MSE = 39.5694
RMSE = 6.2904
SSE = 6647382.9873
MAE = 2.5720
MAPE = 50198065152.0000
R2 = 0.8874
