Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 tcn (TCN)                   (None, 168, 64)           63168     
                                                                 
 lstm (LSTM)                 (None, 168, 48)           21696     
                                                                 
 lstm_1 (LSTM)               (None, 32)                10368     
                                                                 
 dense (Dense)               (None, 1)                 33        
                                                                 
=================================================================
Total params: 95,265
Trainable params: 94,753
Non-trainable params: 512
_________________________________________________________________
MSE = 24.2888
RMSE = 4.9284
SSE = 4076444.1640
MAE = 1.8285
MAPE = 149851062272.0000
R2 = 0.9309

step = 168
rate = 0.9
