Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 tcn (TCN)                   (None, 7, 64)             62144     
                                                                 
 lstm (LSTM)                 (None, 7, 128)            98816     
                                                                 
 lstm_1 (LSTM)               (None, 128)               131584    
                                                                 
 dense (Dense)               (None, 1)                 129       
                                                                 
=================================================================
Total params: 292,673
Trainable params: 292,673
Non-trainable params: 0
_________________________________________________________________
MSE = 41.9062
RMSE = 6.4735
SSE = 7039941.9169
MAE = 2.7291
MAPE = 34088384512.0000
R2 = 0.8807
