Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 tcn (TCN)                   (None, 7, 64)             226496    
                                                                 
 lstm (LSTM)                 (None, 7, 128)            98816     
                                                                 
 lstm_1 (LSTM)               (None, 7, 128)            131584    
                                                                 
 lstm_2 (LSTM)               (None, 128)               131584    
                                                                 
 dense (Dense)               (None, 1)                 129       
                                                                 
=================================================================
Total params: 588,609
Trainable params: 588,609
Non-trainable params: 0
_________________________________________________________________
MSE = 38.3463
RMSE = 6.1924
SSE = 6441905.1906
MAE = 2.3429
MAPE = 347909521408.0000
R2 = 0.8909
